In [1]:
import pandas as pd
import numpy as np

In [14]:
exam_data  = {'nom': ['Anne', 'Alex', 'catherine', 'Jean', 'Emillie', 'Michel', 'Matieu', 'Laura', 'Kevin', 'Jonas'],
        'note': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
              'moyenne' : [12.0, 9, 16.0, 5.0, 9.0, 20.0, 14.0, 15.0, 8.0, 19.0],
        'qualification': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
              'date': ['2005-05-30', '2007-08-12', '2012-08-10', '2005-06-15', '2005-06-13', '2005-01-07', '2007-04-10', '2005-05-19', '2006-07-04', '2006-09-28'],
         'profession': ['boulanger', 'chanteur', 'boulanger', 'cuisinier', 'conducteur', 'cuisinier', 'livreur', 'pilote de ligne', 'mécanicien', np.NAN]}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 6 columns):
nom              10 non-null object
note             8 non-null float64
moyenne          10 non-null float64
qualification    10 non-null object
date             10 non-null object
profession       9 non-null object
dtypes: float64(2), object(4)
memory usage: 880.0+ bytes

In [22]:
pd.to_datetime(df['date'])

a   2005-05-30
b   2007-08-12
c   2012-08-10
d   2005-06-15
e   2005-06-13
f   2005-01-07
g   2007-04-10
h   2005-05-19
i   2006-07-04
j   2006-09-28
Name: date, dtype: datetime64[ns]

In [23]:
df.dtypes

nom               object
note             float64
moyenne          float64
qualification     object
date              object
profession        object
dtype: object

In [7]:
df["qualification"] =="yes"

a     True
b    False
c     True
d    False
e    False
f     True
g     True
h    False
i    False
j     True
Name: qualification, dtype: bool

In [8]:
df[df["qualification"] =="yes"]

         nom  note  moyenne qualification profession
a       Anne  12.5     12.0           yes  boulanger
c  catherine  16.5     16.0           yes  boulanger
f     Michel  20.0     20.0           yes  cuisinier
g     Matieu  14.5     14.0           yes    livreur
j      Jonas  19.0     19.0           yes        NaN

In [10]:
df[df["profession"]=="boulanger"]

         nom  note  moyenne qualification profession
a       Anne  12.5     12.0           yes  boulanger
c  catherine  16.5     16.0           yes  boulanger

In [11]:
# On peut créer un masque
masque = df["profession"]=="boulanger"
df[masque]

         nom  note  moyenne qualification profession
a       Anne  12.5     12.0           yes  boulanger
c  catherine  16.5     16.0           yes  boulanger

In [12]:
masque = df["profession"] != "boulanger"
df[masque]

       nom  note  moyenne qualification       profession
b     Alex   9.0      9.0            no         chanteur
d     Jean   NaN      5.0            no        cuisinier
e  Emillie   9.0      9.0            no       conducteur
f   Michel  20.0     20.0           yes        cuisinier
g   Matieu  14.5     14.0           yes          livreur
h    Laura   NaN     15.0            no  pilote de ligne
i    Kevin   8.0      8.0            no       mécanicien
j    Jonas  19.0     19.0           yes              NaN

In [13]:
df[df["moyenne"] > 10]

         nom  note  moyenne qualification       profession
a       Anne  12.5     12.0           yes        boulanger
c  catherine  16.5     16.0           yes        boulanger
f     Michel  20.0     20.0           yes        cuisinier
g     Matieu  14.5     14.0           yes          livreur
h      Laura   NaN     15.0            no  pilote de ligne
j      Jonas  19.0     19.0           yes              NaN

In [27]:
df['date']=df['date'].astype('datetime64[ns]')
df.info()
df[df["date"]  <="2005-10-01"]

       nom  note  moyenne qualification        date       profession
a     Anne  12.5     12.0           yes  2005-05-30        boulanger
d     Jean   NaN      5.0            no  2005-06-15        cuisinier
e  Emillie   9.0      9.0            no  2005-06-13       conducteur
f   Michel  20.0     20.0           yes  2005-01-07        cuisinier
h    Laura   NaN     15.0            no  2005-05-19  pilote de ligne